NOTE:
-----

Please run the below cells first before proceeding- you'll need them soon!

In [18]:
%load_ext sql
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: None@None'

In [20]:
%%sql
DROP TABLE IF EXISTS Movies;
CREATE TABLE Movies(title VARCHAR(50), year INT, director VARCHAR(50), length INT);
INSERT INTO Movies VALUES('Database Wars', 1967, 'John Joe', 123);
INSERT INTO Movies VALUES('The Databaser', 1992, 'John Bob', 190);
INSERT INTO Movies VALUES('Database Wars', 1998, 'John Jim', 176);

Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [41]:
%sql DROP TABLE IF EXISTS A; DROP TABLE IF EXISTS B;
%sql CREATE TABLE A (x int, y int); CREATE TABLE B (x int, y int);
for i in range(1,6):
    %sql INSERT INTO A VALUES (:i, :i+1)
for i in range(1,11,3):
    %sql INSERT INTO B VALUES (:i, :i+2)

Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

Activity 3-1:
------------

ORDER BY semantics, set operators & nested queries

Exercise #1
-----------

1. Can you write the movie query from lecture as a single SFW query?

Recall: as a nested query, from lecture:

In [30]:
%%sql
SELECT m.title 
FROM Movies m
WHERE m.year <> ANY(SELECT year FROM Movie WHERE title = m.title);

(OperationalError) near "SELECT": syntax error u'SELECT m.title \nFROM Movies m\nWHERE m.year <> ANY(SELECT year FROM Movie WHERE title = m.title);' ()

**ANY doesn't exist in SQLite!**  Can we do this query without nesting?  Write your query here:

In [32]:
# Result you should get (do not re-execute this cell!)
_

[(u'Database Wars',)]

Exercise #2
--------------------

Consider the two relations $A$ and $B$ below:

In [42]:
%sql SELECT * FROM A;

Done.

[(1, 2), (2, 3), (3, 4), (4, 5), (5, 6)]

In [43]:
%sql SELECT * FROM B;

Done.

[(1, 3), (4, 6), (7, 9), (10, 12)]

Assuming no duplicates, can you write an `INTERSECT` query, **just over the $x$ attribute**, without using `INTERSECT` OR nested queries?  Write your query here:

In [46]:
# Result you should get (do not re-execute this cell!)
_

[(1,), (4,)]

What is this operation called??

Next, using set operators again as well, can you return all the _full_ tuples in $A$ and $B$ that overlap in $x$ attributes?  Write your query here:

In [49]:
# Result you should get (do not re-execute this cell!)
_

[(1, 2), (1, 3), (4, 5), (4, 6)]